print("学号：20120013302 姓名：赵晓辉")
info = {
    '1': {'课程号': 1, '课程名': '概率论与数理统计', '学分': 2.0, '开课单位': '数学教研室', '开课教师': '张三'},
    '2': {'课程号': 2, '课程名': 'Python程序设计', '学分': 2.0, '开课单位': '计算机教研室', '开课教师': '李四'},
    '3': {'课程号': 3, '课程名': '大学英语', '学分': 1.0, '开课单位': '外语教研室', '开课教师': '王五'},
    '4': {'课程号': 4, '课程名': 'C#程序设计', '学分': 1.0, '开课单位': '计算机教研室', '开课教师': '赵六'}
}
print("欢迎进入选课查询系统")
while True:
    num = input("请输入课程号：")
    print("您的查询结果是：", str(info[num]))
    choi = input("是否继续查询？y/n")
    if choi == 'n':
        print("谢谢使用！再见！")
        break
